### Report for environment: ndr-dev

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- access-audit-alarm in modules/lambda_alarms
- access-audit-alarm-topic in modules/sns
- access-audit-gateway in modules/gateway
- access-audit-lambda in modules/lambda
- access_audit_dynamodb_table in modules/dynamo_db
- alarm_state_history_table in modules/dynamo_db
- api_endpoint_url_ssm_parameter in modules/ssm_parameter
- auth_session_dynamodb_table in modules/dynamo_db
- auth_state_dynamodb_table in modules/dynamo_db
- authoriser-alarm in modules/lambda_alarms
- authoriser-alarm-topic in modules/sns
- authoriser-lambda in modules/lambda
- back-channel-logout-gateway in modules/gateway
- back_channel_logout_alarm in modules/lambda_alarms
- back_channel_logout_alarm_topic in modules/sns
- back_channel_logout_lambda in modules/lambda
- bulk-upload-alarm in modules/lambda_alarms
- bulk-upload-alarm-topic in modules/sns
- bulk-upload-lambda in modules/lambda
- bulk-upload-metadata-alarm in modules/lambda_alarms
- bulk-upload-metadata-alarm-topic in modules/sns
- bulk-upload-metadata-lambda in modules/lambda
- bulk-upload-report-alarm in modules/lambda_alarms
- bulk-upload-report-alarm-topic in modules/sns
- bulk-upload-report-lambda in modules/lambda
- bulk_upload_metadata_preprocessor_lambda in modules/lambda
- bulk_upload_report_dynamodb_table in modules/dynamo_db
Downloading registry.terraform.io/cloudstoragesec/cloud-storage-security/aws 1.8.7+css9.01.003 for cloud_storage_security...
- cloud_storage_security in .terraform/modules/cloud_storage_security
- cloudfront-distribution-lg in modules/cloudfront
- cloudfront_edge_dynamodb_table in modules/dynamo_db
- cloudfront_firewall_waf_v2 in modules/firewall_waf_v2
- create-doc-ref-lambda in modules/lambda
- create-token-gateway in modules/gateway
- create-token-lambda in modules/lambda
- create_doc_alarm in modules/lambda_alarms
- create_doc_alarm_topic in modules/sns
- create_document_reference_gateway in modules/gateway
- create_token-alarm in modules/lambda_alarms
- create_token-alarm_topic in modules/sns
- data-collection-alarm in modules/lambda_alarms
- data-collection-alarm-topic in modules/sns
- data-collection-lambda in modules/lambda
- delete-doc-ref-gateway in modules/gateway
- delete-doc-ref-lambda in modules/lambda
- delete-document-object-alarm in modules/lambda_alarms
- delete-document-object-alarm-topic in modules/sns
- delete-document-object-lambda in modules/lambda
- delete_doc_alarm in modules/lambda_alarms
- delete_doc_alarm_topic in modules/sns
- document-manifest-job-gateway in modules/gateway
- document-manifest-job-lambda in modules/lambda
- document_manifest_alarm in modules/lambda_alarms
- document_manifest_alarm_topic in modules/sns
- document_reference_dynamodb_table in modules/dynamo_db
- document_upload_check_lambda in modules/lambda
- edge-presign-lambda in modules/lambda_edge
- edge_presign_alarm in modules/lambda_alarms
- edge_presign_alarm_topic in modules/sns
- feature-flags-gateway in modules/gateway
- feature-flags-lambda in modules/lambda
- feature_flags_alarm in modules/lambda_alarms
- feature_flags_alarm_topic in modules/sns
- fhir_document_reference_gateway in modules/gateway
- firewall_waf_v2 in modules/firewall_waf_v2
- firewall_waf_v2_api in modules/firewall_waf_v2
- generate-document-manifest-alarm in modules/lambda_alarms
- generate-document-manifest-alarm-topic in modules/sns
- generate-document-manifest-lambda in modules/lambda
- generate-lloyd-george-stitch-alarm in modules/lambda_alarms
- generate-lloyd-george-stitch-alarm-topic in modules/sns
- generate-lloyd-george-stitch-lambda in modules/lambda
- get-doc-fhir-lambda in modules/lambda
- get-report-by-ods-alarm in modules/lambda_alarms
- get-report-by-ods-alarm-topic in modules/sns
- get-report-by-ods-gateway in modules/gateway
- get-report-by-ods-lambda in modules/lambda
- im-alerting-lambda in modules/lambda
- lambda-layer-alerting in modules/lambda_layers
- lambda-layer-core in modules/lambda_layers
- lambda-layer-data in modules/lambda_layers
- lloyd-george-stitch-gateway in modules/gateway
- lloyd-george-stitch-lambda in modules/lambda
- lloyd-george-stitch_alarm in modules/lambda_alarms
- lloyd-george-stitch_topic in modules/sns
- lloyd_george_reference_dynamodb_table in modules/dynamo_db
- login_redirect-alarm_topic in modules/sns
- login_redirect_alarm in modules/lambda_alarms
- login_redirect_lambda in modules/lambda
- logout-gateway in modules/gateway
- logout_alarm in modules/lambda_alarms
- logout_alarm_topic in modules/sns
- logout_lambda in modules/lambda
- manage-nrl-pointer-alarm in modules/lambda_alarms
- manage-nrl-pointer-alarm-topic in modules/sns
- manage-nrl-pointer-lambda in modules/lambda
- mns-dlq-alarm-topic in modules/sns
- mns-notification-alarm in modules/lambda_alarms
- mns-notification-alarm-topic in modules/sns
- mns-notification-lambda in modules/lambda
- mns_encryption_key in modules/kms
- ndr-app-config in modules/app_config
- ndr-bulk-staging-store in modules/s3
- ndr-docker-ecr-data-collection in modules/ecr
- ndr-docker-ecr-ui in modules/ecr
- ndr-document-store in modules/s3
- ndr-ecs-container-port-ssm-parameter in modules/ssm_parameter
- ndr-ecs-fargate-app in modules/ecs
- ndr-ecs-fargate-data-collection in modules/ecs
- ndr-feedback-mailbox in modules/ses
- ndr-lloyd-george-store in modules/s3
- ndr-vpc-ui in modules/vpc
- ndr-zip-request-store in modules/s3
- nhs-oauth-token-generator-alarm in modules/lambda_alarms
- nhs-oauth-token-generator-alarm-topic in modules/sns
- nhs-oauth-token-generator-lambda in modules/lambda
- nrl-dlq-alarm-topic in modules/sns
- pdf-stitching-alarm-topic in modules/sns
- pdf-stitching-lambda in modules/lambda
- pdf-stitching-lambda-alarms in modules/lambda_alarms
- pdm-document-store in modules/s3
- pdm_dynamodb_table in modules/dynamo_db
- post-document-references-fhir-lambda in modules/lambda
- route53_fargate_ui in modules/route53
- search-document-references-fhir-lambda in modules/lambda
- search-document-references-gateway in modules/gateway
- search-document-references-lambda in modules/lambda
- search-patient-details-gateway in modules/gateway
- search-patient-details-lambda in modules/lambda
- search_doc_alarm in modules/lambda_alarms
- search_doc_alarm_topic in modules/sns
- search_patient_alarm in modules/lambda_alarms
- search_patient_alarm_topic in modules/sns
- send-feedback-alarm in modules/lambda_alarms
- send-feedback-alarm-topic in modules/sns
- send-feedback-gateway in modules/gateway
- send-feedback-lambda in modules/lambda
- sns_encryption_key in modules/kms
- sqs-lg-bulk-upload-invalid-queue in modules/sqs
- sqs-lg-bulk-upload-metadata-queue in modules/sqs
- sqs-mns-notification-queue in modules/sqs
- sqs-nrl-queue in modules/sqs
- sqs-splunk-queue in modules/sqs
- sqs-stitching-queue in modules/sqs
- statistical-report-alarm in modules/lambda_alarms
- statistical-report-alarm-topic in modules/sns
- statistical-report-lambda in modules/lambda
- statistical-reports-store in modules/s3
- statistics_dynamodb_table in modules/dynamo_db
- stitch_metadata_reference_dynamodb_table in modules/dynamo_db
- stitching-dlq-alarm-topic in modules/sns
- toggle-bulk-upload-lambda in modules/lambda
- unstitched_lloyd_george_reference_dynamodb_table in modules/dynamo_db
- update-upload-state-gateway in modules/gateway
- update-upload-state-lambda in modules/lambda
- update_upload_state_alarm in modules/lambda_alarms
- update_upload_state_alarm_topic in modules/sns
- upload_confirm_result_alarm in modules/lambda_alarms
- upload_confirm_result_alarm_topic in modules/sns
- upload_confirm_result_gateway in modules/gateway
- upload_confirm_result_lambda in modules/lambda
- virus_scan_result_alarm in modules/lambda_alarms
- virus_scan_result_alarm_topic in modules/sns
- virus_scan_result_gateway in modules/gateway
- virus_scan_result_lambda in modules/lambda
- zip_store_reference_dynamodb_table in modules/dynamo_db
Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding latest version of hashicorp/random...
- Finding hashicorp/awscc versions matching ">= 0.72.1, ~> 1.0"...
- Finding hashicorp/aws versions matching ">= 4.0.0, ~> 5.0"...
- Finding latest version of hashicorp/archive...
- Finding latest version of hashicorp/time...
- Installing hashicorp/random v3.7.2...
- Installed hashicorp/random v3.7.2 (signed by HashiCorp)
- Installing hashicorp/awscc v1.51.0...
- Installed hashicorp/awscc v1.51.0 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
- Installing hashicorp/archive v2.7.1...
- Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
- Installing hashicorp/time v0.13.1...
- Installed hashicorp/time v0.13.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (2 to add, 445 to change, 1 to destroy)</summary>

```


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.edge-presign-lambda.aws_lambda_function.lambda has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_EdgePresignLambda"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:[REDACTED_AWS_ACCOUNT_ID]:function:ndr-dev_EdgePresignLambda:272" -> "arn:aws:lambda:us-east-1:[REDACTED_AWS_ACCOUNT_ID]:function:ndr-dev_EdgePresignLambda:276"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ndr-ecs-fargate-app.aws_ecs_task_definition.ndr_ecs_task has changed
  ~ resource "aws_ecs_task_definition" "ndr_ecs_task" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/ndr-dev-task-app-cluster:334" -> "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/ndr-dev-task-app-cluster:338"
        id                       = "ndr-dev-task-app-cluster"
        tags                     = {}
        # (16 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_toggle_bulk_upload_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_toggle_bulk_upload_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:GetEventSourceMapping",
              + "lambda:UpdateEventSourceMapping",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:event-source-mapping:61fb099a-c89e-48ec-b4f4-da724336046f",
            ]
        }
    }

  # aws_api_gateway_api_key.api_key_pdm will be updated in-place
  ~ resource "aws_api_gateway_api_key" "api_key_pdm" {
        id                = "4l3ya2x6b3"
        name              = "ndr-dev_pdm-api-key"
        tags              = {}
      ~ tags_all          = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_api_key.apim will be updated in-place
  ~ resource "aws_api_gateway_api_key" "apim" {
        id                = "81dp1i9uvc"
        name              = "ndr-dev_apim-api-key"
        tags              = {}
      ~ tags_all          = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_client_certificate.ndr_api will be updated in-place
  ~ resource "aws_api_gateway_client_certificate" "ndr_api" {
        id                      = "rl5xgs"
        tags                    = {}
      ~ tags_all                = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.ndr_api_deploy must be replaced
+/- resource "aws_api_gateway_deployment" "ndr_api_deploy" {
      ~ created_date  = "2025-07-31T08:18:16Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ccy0v3rve9/" -> (known after apply)
      ~ id            = "9njhnc" -> (known after apply)
      ~ invoke_url    = "[REDACTED_API_GATEWAY_URL]" -> (known after apply)
      ~ variables     = {
          - "deployed_at" = "2025-07-31T08:18:16Z"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_domain_name.custom_api_domain will be updated in-place
  ~ resource "aws_api_gateway_domain_name" "custom_api_domain" {
        id                                     = "api-ndr-dev.access-request-fulfilment.patient-deductions.nhs.uk"
        tags                                   = {}
      ~ tags_all                               = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_rest_api.ndr_doc_store_api will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "ndr_doc_store_api" {
        id                           = "ccy0v3rve9"
        name                         = "ndr-dev-DocStoreAPI"
      ~ tags                         = {
          - "Environment" = "dev" -> null
            "Name"        = "ndr-dev-docstore-api"
          - "Owner"       = "nhse/ndr-team" -> null
          - "Workspace"   = "ndr-dev" -> null
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.ndr_api will be updated in-place
  ~ resource "aws_api_gateway_stage" "ndr_api" {
      ~ deployment_id         = "9njhnc" -> (known after apply)
        id                    = "ags-ccy0v3rve9-dev"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (13 unchanged attributes hidden)
    }

  # aws_api_gateway_usage_plan.api_key_pdm will be updated in-place
  ~ resource "aws_api_gateway_usage_plan" "api_key_pdm" {
        id           = "8yvge9"
        name         = "ndr-dev_pdm-usage-plan"
        tags         = {}
      ~ tags_all     = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_usage_plan.apim will be updated in-place
  ~ resource "aws_api_gateway_usage_plan" "apim" {
        id           = "s9g8xi"
        name         = "ndr-dev_apim-usage-plan"
        tags         = {}
      ~ tags_all     = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_backup_plan.s3_continuous_backup will be updated in-place
  ~ resource "aws_backup_plan" "s3_continuous_backup" {
        id       = "82ee1c2c-ab84-44de-bc6f-872117ee60c8"
        name     = "ndr-dev_s3_continuous_backup"
        tags     = {}
      ~ tags_all = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_backup_vault.backup_vault will be updated in-place
  ~ resource "aws_backup_vault" "backup_vault" {
        id              = "ndr-dev_backup_vault"
        name            = "ndr-dev_backup_vault"
        tags            = {}
      ~ tags_all        = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.bulk_upload_disable_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "bulk_upload_disable_rule" {
        id                  = "ndr-dev_bulk_upload_disable"
        name                = "ndr-dev_bulk_upload_disable"
        tags                = {}
      ~ tags_all            = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.bulk_upload_enable_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "bulk_upload_enable_rule" {
        id                  = "ndr-dev_bulk_upload_enable"
        name                = "ndr-dev_bulk_upload_enable"
        tags                = {}
      ~ tags_all            = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.bulk_upload_metadata_schedule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "bulk_upload_metadata_schedule" {
        id                  = "ndr-dev_bulk_upload_metadata_schedule"
        name                = "ndr-dev_bulk_upload_metadata_schedule"
        tags                = {}
      ~ tags_all            = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.bulk_upload_report_schedule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "bulk_upload_report_schedule" {
        id                  = "ndr-dev_bulk_upload_report_schedule"
        name                = "ndr-dev_bulk_upload_report_schedule"
        tags                = {}
      ~ tags_all            = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.data_collection_schedule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "data_collection_schedule" {
        id                  = "ndr-dev_data_collection_schedule"
        name                = "ndr-dev_data_collection_schedule"
        tags                = {}
      ~ tags_all            = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.nhs_oauth_token_generator_schedule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "nhs_oauth_token_generator_schedule" {
        id                  = "ndr-dev_nhs_oauth_token_generator_schedule"
        name                = "ndr-dev_nhs_oauth_token_generator_schedule"
        tags                = {}
      ~ tags_all            = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.statistical_report_schedule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "statistical_report_schedule" {
        id                  = "ndr-dev_statistical_report_schedule"
        name                = "ndr-dev_statistical_report_schedule"
        tags                = {}
      ~ tags_all            = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.api_gateway_stage will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "api_gateway_stage" {
        id                = "API-Gateway-Execution-Logs_ccy0v3rve9/dev"
        name              = "API-Gateway-Execution-Logs_ccy0v3rve9/dev"
        tags              = {}
      ~ tags_all          = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.api_gateway_alarm_4XX[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "api_gateway_alarm_4XX" {
        id                                    = "4XX-status-ndr-dev-DocStoreAPI"
      ~ tags                                  = {
          - "Environment" = "dev" -> null
            "Name"        = "4XX-status-ndr-dev-DocStoreAPI"
          - "Owner"       = "nhse/ndr-team" -> null
          - "Workspace"   = "ndr-dev" -> null
        }
        # (22 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.api_gateway_alarm_5XX[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "api_gateway_alarm_5XX" {
        id                                    = "5XX-status-ndr-dev-DocStoreAPI"
      ~ tags                                  = {
          - "Environment" = "dev" -> null
            "Name"        = "5XX-status-ndr-dev-DocStoreAPI"
          - "Owner"       = "nhse/ndr-team" -> null
          - "Workspace"   = "ndr-dev" -> null
        }
        # (22 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.edge_presign_lambda_error[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "edge_presign_lambda_error" {
        id                                    = "ndr-dev_EdgePresignLambda_error_alarm"
        tags                                  = {}
      ~ tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (21 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.msn_dlq_new_message will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "msn_dlq_new_message" {
        id                                    = "ndr-dev_MNS_dlq_messages"
        tags                                  = {}
      ~ tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (21 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.nrl_dlq_new_messages will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "nrl_dlq_new_messages" {
        id                                    = "ndr-dev_NRL_dlq_messages"
        tags                                  = {}
      ~ tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (21 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.stitching_dlq_new_messages will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "stitching_dlq_new_messages" {
        id                                    = "ndr-dev_stitching_dlq_messages"
        tags                                  = {}
      ~ tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (21 unchanged attributes hidden)
    }

  # aws_cognito_identity_pool.cloudwatch_rum[0] will be updated in-place
  ~ resource "aws_cognito_identity_pool" "cloudwatch_rum" {
        id                               = "eu-west-2:bffbdb3e-e8cc-4198-96f6-bc0362ad25ca"
        tags                             = {}
      ~ tags_all                         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_default_security_group.default will be updated in-place
  ~ resource "aws_default_security_group" "default" {
        id                     = "sg-0cb2291eea749db43"
        name                   = "default"
        tags                   = {}
      ~ tags_all               = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_default_vpc.default will be updated in-place
  ~ resource "aws_default_vpc" "default" {
        id                                   = "vpc-076b27d0e8b5066f5"
        tags                                 = {
            "Name" = "Default VPC"
        }
      ~ tags_all                             = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
            # (1 unchanged element hidden)
        }
        # (20 unchanged attributes hidden)
    }

  # aws_iam_policy.alerting_lambda_alarms will be updated in-place
  ~ resource "aws_iam_policy" "alerting_lambda_alarms" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_alerting_lambda_alarms_policy"
        name             = "ndr-dev_alerting_lambda_alarms_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.alerting_lambda_tags will be updated in-place
  ~ resource "aws_iam_policy" "alerting_lambda_tags" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_alerting_lambda_tags_policy"
        name             = "ndr-dev_alerting_lambda_tags_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.cloudwatch_log_query_policy will be updated in-place
  ~ resource "aws_iam_policy" "cloudwatch_log_query_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_cloudwatch_log_query_policy"
        name             = "ndr-dev_cloudwatch_log_query_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.cloudwatch_rum_cognito_access[0] will be updated in-place
  ~ resource "aws_iam_policy" "cloudwatch_rum_cognito_access" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev-cloudwatch-rum-cognito-access-policy"
        name             = "ndr-dev-cloudwatch-rum-cognito-access-policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.dynamodb_policy_scan_bulk_report will be updated in-place
  ~ resource "aws_iam_policy" "dynamodb_policy_scan_bulk_report" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_BulkUploadReport_scan_policy"
        name             = "ndr-dev_BulkUploadReport_scan_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.dynamodb_stream_delete_object_policy will be updated in-place
  ~ resource "aws_iam_policy" "dynamodb_stream_delete_object_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_dynamodb_stream_to_delete_records_policy"
        name             = "ndr-dev_dynamodb_stream_to_delete_records_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.dynamodb_stream_manifest will be updated in-place
  ~ resource "aws_iam_policy" "dynamodb_stream_manifest" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_dynamodb_stream_to_manifest_policy"
        name             = "ndr-dev_dynamodb_stream_to_manifest_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.dynamodb_stream_stitch_policy will be updated in-place
  ~ resource "aws_iam_policy" "dynamodb_stream_stitch_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_dynamodb_stream_to_stitch_policy"
        name             = "ndr-dev_dynamodb_stream_to_stitch_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.kms_mns_lambda_access[0] will be updated in-place
  ~ resource "aws_iam_policy" "kms_mns_lambda_access" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_mns_notification_lambda_access_policy"
        name             = "ndr-dev_mns_notification_lambda_access_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_audit_splunk_sqs_queue_send_policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "lambda_audit_splunk_sqs_queue_send_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/terraform-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]15"
        name             = "terraform-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]15"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_toggle_bulk_upload_policy will be updated in-place
  ~ resource "aws_iam_policy" "lambda_toggle_bulk_upload_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_lambda_toggle_bulk_upload_policy"
        name             = "ndr-dev_lambda_toggle_bulk_upload_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:UpdateEventSourceMapping",
                          - "lambda:GetEventSourceMapping",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:event-source-mapping:61fb099a-c89e-48ec-b4f4-da724336046f"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.s3_document_data_policy_for_get_doc_ref_lambda will be updated in-place
  ~ resource "aws_iam_policy" "s3_document_data_policy_for_get_doc_ref_lambda" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_get_document_only_policy_for_get_doc_lambda"
        name             = "ndr-dev_get_document_only_policy_for_get_doc_lambda"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.s3_document_data_policy_for_manifest_lambda will be updated in-place
  ~ resource "aws_iam_policy" "s3_document_data_policy_for_manifest_lambda" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_get_document_only_policy_for_manifest_lambda"
        name             = "ndr-dev_get_document_only_policy_for_manifest_lambda"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.s3_document_data_policy_for_ods_report_lambda will be updated in-place
  ~ resource "aws_iam_policy" "s3_document_data_policy_for_ods_report_lambda" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_get_document_only_policy_for_ods_report_lambda"
        name             = "ndr-dev_get_document_only_policy_for_ods_report_lambda"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.s3_document_data_policy_for_stitch_lambda will be updated in-place
  ~ resource "aws_iam_policy" "s3_document_data_policy_for_stitch_lambda" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_get_document_only_policy_for_stitch_lambda"
        name             = "ndr-dev_get_document_only_policy_for_stitch_lambda"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.s3_document_data_policy_put_only will be updated in-place
  ~ resource "aws_iam_policy" "s3_document_data_policy_put_only" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_put_document_only_policy"
        name             = "ndr-dev_put_document_only_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.ses_send_email_policy will be updated in-place
  ~ resource "aws_iam_policy" "ses_send_email_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_ses_send_email_policy"
        name             = "ndr-dev_ses_send_email_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.ssm_access_policy will be updated in-place
  ~ resource "aws_iam_policy" "ssm_access_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_ssm_parameters"
        name             = "ndr-dev_ssm_parameters"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.ssm_access_policy_authoriser will be updated in-place
  ~ resource "aws_iam_policy" "ssm_access_policy_authoriser" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_ssm_public_token_policy"
        name             = "ndr-dev_ssm_public_token_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role.api_gateway_cloudwatch[0] will be updated in-place
  ~ resource "aws_iam_role" "api_gateway_cloudwatch" {
        id                    = "ndr-dev_NdrAPIGatewayLogs"
        name                  = "ndr-dev_NdrAPIGatewayLogs"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.cognito_unauthenticated[0] will be updated in-place
  ~ resource "aws_iam_role" "cognito_unauthenticated" {
        id                    = "ndr-dev-cognito-unauth-role"
        name                  = "ndr-dev-cognito-unauth-role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.create_post_presign_url_role will be updated in-place
  ~ resource "aws_iam_role" "create_post_presign_url_role" {
        id                    = "ndr-dev_create_post_presign_url_role"
        name                  = "ndr-dev_create_post_presign_url_role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.data_collection_ecs_execution[0] will be updated in-place
  ~ resource "aws_iam_role" "data_collection_ecs_execution" {
        id                    = "ndr-dev_data_collection_scheduler_role"
        name                  = "ndr-dev_data_collection_scheduler_role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.data_collection_task_role[0] will be updated in-place
  ~ resource "aws_iam_role" "data_collection_task_role" {
        id                    = "ndr-dev_data_collection_task_role"
        name                  = "ndr-dev_data_collection_task_role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.get_fhir_doc_presign_url_role[0] will be updated in-place
  ~ resource "aws_iam_role" "get_fhir_doc_presign_url_role" {
        id                    = "ndr-dev_get_fhir_doc_presign_url_role"
        name                  = "ndr-dev_get_fhir_doc_presign_url_role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.manifest_presign_url_role will be updated in-place
  ~ resource "aws_iam_role" "manifest_presign_url_role" {
        id                    = "ndr-dev_manifest_presign_url_role"
        name                  = "ndr-dev_manifest_presign_url_role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.ods_report_presign_url_role will be updated in-place
  ~ resource "aws_iam_role" "ods_report_presign_url_role" {
        id                    = "ndr-dev_ods_report_presign_url_role"
        name                  = "ndr-dev_ods_report_presign_url_role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.s3_backup_iam_role will be updated in-place
  ~ resource "aws_iam_role" "s3_backup_iam_role" {
        id                    = "ndr-dev_s3_backup_iam_role"
        name                  = "ndr-dev_s3_backup_iam_role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.splunk_sqs_forwarder[0] will be updated in-place
  ~ resource "aws_iam_role" "splunk_sqs_forwarder" {
        id                    = "dev_splunk_sqs_forwarder_role"
        name                  = "dev_splunk_sqs_forwarder_role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.stitch_presign_url_role will be updated in-place
  ~ resource "aws_iam_role" "stitch_presign_url_role" {
        id                    = "ndr-dev_stitch_presign_url_role"
        name                  = "ndr-dev_stitch_presign_url_role"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.bulk_upload_lambda will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "bulk_upload_lambda" {
        id                                 = "61fb099a-c89e-48ec-b4f4-da724336046f"
        tags                               = {}
      ~ tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_event_source_mapping.document_reference_dynamodb_stream will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "document_reference_dynamodb_stream" {
        id                                 = "619740f6-e73b-4757-865a-3279e23c953d"
        tags                               = {}
      ~ tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_event_source_mapping.dynamodb_stream_manifest will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "dynamodb_stream_manifest" {
        id                                 = "4e7a8db8-f870-468c-8539-0ccc1634a772"
        tags                               = {}
      ~ tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_event_source_mapping.dynamodb_stream_stitch will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "dynamodb_stream_stitch" {
        id                                 = "79f47971-403d-4e1c-b0a6-220f8d0927a8"
        tags                               = {}
      ~ tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_event_source_mapping.lloyd_george_dynamodb_stream will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "lloyd_george_dynamodb_stream" {
        id                                 = "7a5bda37-11e9-4300-a838-b356d2794791"
        tags                               = {}
      ~ tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_event_source_mapping.mns_notification_lambda[0] will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "mns_notification_lambda" {
        id                                 = "b5f7bc77-dd99-4a30-98bb-9f36e159817b"
        tags                               = {}
      ~ tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (23 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.nrl_pointer_lambda will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "nrl_pointer_lambda" {
        id                                 = "f405dcf5-bc00-4c5e-b89a-94055bac2d5a"
        tags                               = {}
      ~ tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_event_source_mapping.pdf-stitching-lambda will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "pdf-stitching-lambda" {
        id                                 = "61979aa3-85cf-4cd9-8a48-b6c597abfca9"
        tags                               = {}
      ~ tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (23 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.unstitched_lloyd_george_dynamodb_stream will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "unstitched_lloyd_george_dynamodb_stream" {
        id                                 = "e650bda2-40c2-4686-83f7-1d4b05ba5778"
        tags                               = {}
      ~ tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_resourcegroups_group.workspace_resource_group will be created
  + resource "aws_resourcegroups_group" "workspace_resource_group" {
      + arn         = (known after apply)
      + description = "ndr-dev workspace resource group."
      + id          = (known after apply)
      + name        = "ndr-dev-resource_group"
      + tags        = {
          + "Name" = "ndr-dev-resource_group"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "Name"        = "ndr-dev-resource_group"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }

      + resource_query {
          + query = jsonencode(
                {
                  + ResourceTypeFilters = [
                      + "AWS::AllSupported",
                    ]
                  + TagFilters          = [
                      + {
                          + Key    = "Workspace"
                          + Values = [
                              + "ndr-dev",
                            ]
                        },
                    ]
                }
            )
          + type  = "TAG_FILTERS_1_0"
        }
    }

  # aws_rum_app_monitor.ndr[0] will be updated in-place
  ~ resource "aws_rum_app_monitor" "ndr" {
        id             = "ndr-dev-app-monitor"
        name           = "ndr-dev-app-monitor"
        tags           = {}
      ~ tags_all       = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_sns_topic.alarm_notifications_topic[0] will be updated in-place
  ~ resource "aws_sns_topic" "alarm_notifications_topic" {
        id                                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-alarms-notification-topic-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]14"
        name                                     = "ndr-dev-alarms-notification-topic-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]14"
        tags                                     = {}
      ~ tags_all                                 = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (29 unchanged attributes hidden)
    }

  # module.access-audit-alarm.aws_cloudwatch_metric_alarm.lambda_duration_alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "lambda_duration_alarm" {
        id                                    = "ndr-dev-alarm_access_audit_handler_duration"
        tags                                  = {}
      ~ tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (21 unchanged attributes hidden)
    }

  # module.access-audit-alarm.aws_cloudwatch_metric_alarm.lambda_error will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "lambda_error" {
        id                                    = "ndr-dev-alarm_access_audit_handler_error"
        tags                                  = {}
      ~ tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (21 unchanged attributes hidden)
    }

  # module.access-audit-alarm.aws_cloudwatch_metric_alarm.lambda_memory_alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "lambda_memory_alarm" {
        id                                    = "ndr-dev-alarm_access_audit_handler_memory"
        tags                                  = {}
      ~ tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (21 unchanged attributes hidden)
    }

  # module.access-audit-alarm-topic.aws_sns_topic.sns_topic will be updated in-place
  ~ resource "aws_sns_topic" "sns_topic" {
        id                                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-access-audit-alarms-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]06"
        name                                     = "ndr-dev-sns-access-audit-alarms-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]06"
        tags                                     = {}
      ~ tags_all                                 = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (29 unchanged attributes hidden)
    }

  # module.access-audit-lambda.data.archive_file.lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "placeholder_lambda_payload.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "placeholder_lambda.py"
      + type                = "zip"
    }

  # module.access-audit-lambda.data.aws_iam_policy_document.assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.access-audit-lambda.data.aws_iam_policy_document.merged_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "merged_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
    }

  # module.access-audit-lambda.aws_iam_policy.combined_policies will be updated in-place
  ~ resource "aws_iam_policy" "combined_policies" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_AccessAuditLambda_combined_policy"
        name             = "ndr-dev_AccessAuditLambda_combined_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "appconfig:StartConfigurationSession",
                          - "appconfig:GetLatestConfiguration",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:appconfig:*:*:application/cbe8t8t/environment/w3zulwr/configuration/tsaegbq"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata/index/NDRSessionIdIndex"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AccessAudit"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (6 unchanged attributes hidden)
    }

  # module.access-audit-lambda.aws_iam_role.lambda_execution_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_execution_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "ndr-dev_lambda_execution_role_AccessAuditLambda"
        name                  = "ndr-dev_lambda_execution_role_AccessAuditLambda"
        tags                  = {}
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (10 unchanged attributes hidden)
    }

  # module.access-audit-lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_AccessAuditLambda"
        tags                           = {}
      ~ tags_all                       = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.access_audit_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb_read_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AccessAudit",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AccessAudit/index/UserSessionIDIndex",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AccessAudit/index/UserIDIndex",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AccessAudit/index/UserOdsCodeIndex",
            ]
        }
    }

  # module.access_audit_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb_write_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AccessAudit",
            ]
        }
    }

  # module.access_audit_dynamodb_table.aws_dynamodb_table.ndr_dynamodb_table will be updated in-place
  ~ resource "aws_dynamodb_table" "ndr_dynamodb_table" {
        id                          = "ndr-dev_AccessAudit"
        name                        = "ndr-dev_AccessAudit"
      ~ tags                        = {
          - "Environment" = "dev" -> null
            "Name"        = "ndr-dev_AccessAudit"
          - "Owner"       = "nhse/ndr-team" -> null
          - "Workspace"   = "ndr-dev" -> null
        }
        # (13 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

  # module.access_audit_dynamodb_table.aws_iam_policy.dynamodb_policy will be updated in-place
  ~ resource "aws_iam_policy" "dynamodb_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_AccessAudit_policy"
        name             = "ndr-dev_AccessAudit_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # module.alarm_state_history_table.data.aws_iam_policy_document.dynamodb_read_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb_read_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AlarmStateHistory",
            ]
        }
    }

  # module.alarm_state_history_table.data.aws_iam_policy_document.dynamodb_write_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb_write_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AlarmStateHistory",
            ]
        }
    }

  # module.alarm_state_history_table.aws_dynamodb_table.ndr_dynamodb_table will be updated in-place
  ~ resource "aws_dynamodb_table" "ndr_dynamodb_table" {
        id                          = "ndr-dev_AlarmStateHistory"
        name                        = "ndr-dev_AlarmStateHistory"
      ~ tags                        = {
          - "Environment" = "dev" -> null
            "Name"        = "ndr-dev_AlarmStateHistory"
          - "Owner"       = "nhse/ndr-team" -> null
          - "Workspace"   = "ndr-dev" -> null
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.alarm_state_history_table.aws_iam_policy.dynamodb_policy will be updated in-place
  ~ resource "aws_iam_policy" "dynamodb_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_AlarmStateHistory_policy"
        name             = "ndr-dev_AlarmStateHistory_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # module.api_endpoint_url_ssm_parameter.aws_ssm_parameter.secret will be updated in-place
  ~ resource "aws_ssm_parameter" "secret" {
        id              = "/ndr/ndr-dev/api_endpoint"
        name            = "/ndr/ndr-dev/api_endpoint"
      ~ tags            = {
          - "Environment" = "dev" -> null
            "Name"        = "ndr-dev-ssm"
          - "Owner"       = "nhse/ndr-team" -> null
          - "Workspace"   = "ndr-dev" -> null
        }
        # (11 unchanged attributes hidden)
    }

  # module.auth_session_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb_read_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata/index/NDRSessionIdIndex",
            ]
        }
    }

  # module.auth_session_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb_write_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata",
            ]
        }
    }

  # module.auth_session_dynamodb_table.aws_dynamodb_table.ndr_dynamodb_table will be updated in-place
  ~ resource "aws_dynamodb_table" "ndr_dynamodb_table" {
        id                          = "ndr-dev_AuthSessionReferenceMetadata"
        name                        = "ndr-dev_AuthSessionReferenceMetadata"
      ~ tags                        = {
          - "Environment" = "dev" -> null
            "Name"        = "ndr-dev_AuthSessionReferenceMetadata"
          - "Owner"       = "nhse/ndr-team" -> null
          - "Workspace"   = "ndr-dev" -> null
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.auth_session_dynamodb_table.aws_iam_policy.dynamodb_policy will be updated in-place
  ~ resource "aws_iam_policy" "dynamodb_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_AuthSessionReferenceMetadata_policy"
        name             = "ndr-dev_AuthSessionReferenceMetadata_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # module.auth_state_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb_read_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthStateReferenceMetadata",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthStateReferenceMetadata/index/StateIndex",
            ]
        }
    }

  # module.auth_state_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb_write_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthStateReferenceMetadata",
            ]
        }
    }

  # module.auth_state_dynamodb_table.aws_dynamodb_table.ndr_dynamodb_table will be updated in-place
  ~ resource "aws_dynamodb_table" "ndr_dynamodb_table" {
        id                          = "ndr-dev_AuthStateReferenceMetadata"
        name                        = "ndr-dev_AuthStateReferenceMetadata"
      ~ tags                        = {
          - "Environment" = "dev" -> null
            "Name"        = "ndr-dev_AuthStateReferenceMetadata"
          - "Owner"       = "nhse/ndr-team" -> null
          - "Workspace"   = "ndr-dev" -> null
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.auth_state_dynamodb_table.aws_iam_policy.dynamodb_policy will be updated in-place
  ~ resource "aws_iam_policy" "dynamodb_policy" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_AuthStateReferenceMetadata_policy"
        name             = "ndr-dev_AuthStateReferenceMetadata_policy"
        tags             = {}
      ~ tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # module.authoriser-alarm.aws_cloudwatch_metric_alarm.lambda_duration_alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "lambda_duration_alarm" {
        id                                    = "ndr-dev-alarm_authoriser_handler_duration"
        tags                                  = {}
      ~ tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (21 unchanged attributes hidden)
    }

  # module.authoriser-alarm.aws_cloudwatch_metric_alarm.lambda_error will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "lambda_error" {
        id                                    = "ndr-dev-alarm_authoriser_handler_error"
        tags                                  = {}
      ~ tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (21 unchanged attributes hidden)
    }

  # module.authoriser-alarm.aws_cloudwatch_metric_alarm.lambda_memory_alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "lambda_memory_alarm" {
        id                                    = "ndr-dev-alarm_authoriser_handler_memory"
        tags                                  = {}
      ~ tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
        # (21 unchanged attributes hidden)
    }

  # module.authoriser-alarm-topic.aws_sns_topic.sns_topic will be updated in-place
  ~ resource "aws_sns_topic" "sns_topic" {
        id                                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-create_doc-alarms-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]5f"
        name                                     = "ndr-dev-sns-create_doc-ala
(truncated - see workflow logs for full output)
```

</details>